In [2]:
import pandas as pd
import numpy as np

### multi-indexed series

In [14]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
                18976457, 19378102,
                20851820, 25145561]
pop = pd.Series(populations, index=index)
index

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [33]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [34]:
pop = pd.Series(populations, index=index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### potential to add more dimensions

In [35]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [36]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [37]:
pop_df = pd.DataFrame({'total': pop,
                          'under18': [9267089, 9284094,
                                      4687374, 4318033,
                                      5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [38]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

### creation

In [24]:
# list of muliple index
df = pd.DataFrame(np.random.rand(4, 2),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=['data1', 'data2'])
df

        data1     data2
a 1  0.147911  0.565483
  2  0.483621  0.224440
b 1  0.318106  0.948484
  2  0.679041  0.573753

In [25]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [26]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [27]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [30]:
np.meshgrid(['a', 'b'], [1, 2])

[array([['a', 'b'],
        ['a', 'b']], dtype='<U1'),
 array([[1, 1],
        [2, 2]])]

In [31]:
np.meshgrid([3,4], [1, 2])

[array([[3, 4],
        [3, 4]]),
 array([[1, 1],
        [2, 2]])]

In [39]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In [40]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                    names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  38.2  24.0  36.3  61.0  36.0
     2      21.0  36.4  34.0  37.8  32.0  36.8
2014 1      38.0  37.6  52.0  35.4  36.0  36.8
     2      26.0  34.9  44.0  37.8  32.0  36.4

In [41]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      24.0  36.3
     2      34.0  37.8
2014 1      52.0  35.4
     2      44.0  37.8

### indexing and slicing

In [42]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [43]:
pop['California', 2000]

33871648

In [44]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [45]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [46]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [47]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [48]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [49]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  38.2  24.0  36.3  61.0  36.0
     2      21.0  36.4  34.0  37.8  32.0  36.8
2014 1      38.0  37.6  52.0  35.4  36.0  36.8
     2      26.0  34.9  44.0  37.8  32.0  36.4

In [50]:
health_data['Guido', 'HR']

year  visit
2013  1        24.0
      2        34.0
2014  1        52.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [51]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      41.0  38.2
     2      21.0  36.4

In [52]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        41.0
      2        21.0
2014  1        38.0
      2        26.0
Name: (Bob, HR), dtype: float64

In [54]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      41.0  24.0  61.0
2014 1      38.0  52.0  36.0

### rearranging MI

In [55]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.157035
      2      0.233607
c     1      0.628948
      2      0.527497
b     1      0.719889
      2      0.025768
dtype: float64

In [56]:
data = data.sort_index()
data

char  int
a     1      0.157035
      2      0.233607
b     1      0.719889
      2      0.025768
c     1      0.628948
      2      0.527497
dtype: float64

In [68]:
data['a':'b']# sorted allows slicing

char  int
a     1      0.157035
      2      0.233607
b     1      0.719889
      2      0.025768
dtype: float64

In [67]:
# stacking and unstacking indices
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [61]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [64]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [66]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [69]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [70]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [71]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      41.0  38.2  24.0  36.3  61.0  36.0
     2      21.0  36.4  34.0  37.8  32.0  36.8
2014 1      38.0  37.6  52.0  35.4  36.0  36.8
     2      26.0  34.9  44.0  37.8  32.0  36.4

In [74]:
data_mean = health_data.groupby('year').mean()
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     31.0  37.30  29.0  37.05  46.5  36.4
2014     32.0  36.25  48.0  36.60  34.0  36.6

In [77]:
data_mean.T.groupby('subject').mean()

year       2013    2014
subject
Bob      34.150  34.125
Guido    33.025  42.300
Sue      41.450  35.300

### aggregation